Namespace:   Autodesk.Revit.UI.Macros
  Assembly:   RevitAPIUI  (in RevitAPIUI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public override List<RibbonPanel> GetRibbonPanels(
	Tab tab
)
  Visual Basic
Public Overrides Function GetRibbonPanels ( _
	tab As Tab _
) As List(Of RibbonPanel)
  Visual C++
public:
virtual List<RibbonPanel^>^ GetRibbonPanels(
	Tab tab
) override
 Parameters
  tab
 Type:  Autodesk.Revit.UI Tab
 See Also
  ApplicationEntryPoint Class
  GetRibbonPanels Overload
  Autodesk.Revit.UI.Macros Namespace